plots = {
    "plot1": "Ти прокидаєшся на галявині серед густого, туманного лісу. Сонячні промені ледь пробиваються крізь товсті крони дерев, а вологе повітря наповнене ароматом свіжої землі та рослинності. У голові відлунює гучний дзвін, і ти намагаєшся згадати, як потрапив сюди, але пам’ять розсипається, як пісок крізь пальці. Лише один спогад чітко тримається в твоїй свідомості – древній храм, схований у самому серці цього лісу, і відчуття, що саме там прихована відповідь на всі твої питання. Шлях до храму не буде легким: ліс відомий своїми небезпечними створіннями, таємничими пастками і зачарованими місцями, де реальність переплітається зі снами. Тобі доведеться покладатися на свою інтуїцію та хитрість, щоб дістатися до мети і дізнатися правду про своє минуле і майбутнє.",
    "plot2": "Рік 2147. Ти живеш у світі, де міста стали величезними механізмами, керованими штучним інтелектом. Людство поступово втратило свободу, підкоряючись ритму високотехнологічного суспільства. Ти – один з останніх незалежних хакерів, який ще не потрапив під контроль Системи. У своїй маленькій, захаращеній квартирі, серед мерехтіння моніторів та звуків кулера, ти отримуєш несподіване повідомлення: 'Система зламана. Єдиний шанс зупинити повний контроль – діяти зараз'. Відправником є невідомий тобі хакер, який називає себе «Тінню». Він дає тобі координати та інструкції для проникнення в головний сервер, де зберігається ядро Системи. Але дорога до нього буде сповнена небезпек: системні дрони, цифрові пастки і охоронні програми вже чекають на тебе. Ти маєш використати весь свій досвід, щоб обійти захист і розкрити змову, яка може визначити майбутнє всього людства.",
    "plot3": "У віддаленій частині світу, серед гір і лісів, заховані входи до древніх катакомб, які ніхто не наважується досліджувати. Легенди говорять про величезне підземне королівство, де жили істоти, забуті часом, і де зберігається артефакт неймовірної сили. Ти – дослідник, який вирішив знайти цей артефакт, що, за чутками, може змінити хід історії. Після місяців підготовки ти нарешті спускаєшся в темряву катакомб. Повітря стає важким, а тиша гнітить. Ступаючи вузькими коридорами, ти відчуваєш, що кожен твій крок чує хтось невидимий. На твоєму шляху зустрічаються древні фрески, що зображають сцени великих битв і невідомих істот. Ти розумієш, що це місце – не просто забута гробниця, а ціле підземне королівство, де ще живуть ті, хто його побудував. Твоя мета – знайти артефакт і вирішити, що з ним робити: знищити його, щоб уникнути катастрофи, або скористатися його силою, щоб змінити світ."

}


after_fight = '''
Ти важко дихаєш, відчуваючи, як кров пульсує у скронях. Монстр лежить переможений, але битва забрала у тебе чимало сил. Коли пил осідає, ти помічаєш, що за залишками тіні монстра ховається постать. Це старий мандрівник, одягнений у пошарпаний сірий плащ, який майже повністю приховує його худе тіло. Обличчя вкриває густа, сива борода, а під каптуром ледь видніються пронизливі, мудрі очі. Він виходить на світло і злегка кланяється.

- 'Вражаюча перемога,' – каже він хрипким голосом.
– 'Ця тварина давно охороняє шлях до забутої святині. Я знав, що рано чи пізно з’явиться той, хто зможе її перемогти.'
Його зморшкувате обличчя і напівусмішка вказують на досвід і життєву мудрість. Здається, цей мандрівник знає більше, ніж здається на перший погляд, і він може вказати тобі подальший шлях у твоїй пригоді.
'''


road_to_bow_with_arrows = '''
Він вдивляється в твої речі й помічає, що серед них є стріли.

- 'Цікаво,' – каже він, злегка піднімаючи брову. – 'Ти маєш стріли, але де твій лук? Нелегка дорога чекає на того, хто не має всього необхідного спорядження.'
Ти знизуєш плечима, адже справді не маєш лука.

'Я знаю, де ти можеш його знайти,' – продовжує мандрівник. – 'Недалеко звідси, за старим мостом, за лісом є покинута церква. Кажуть, там зберігається древній лук, який колись належав великому воїну. Це місце приховане від очей більшості, але я впевнений, що ти знайдеш його, якщо підеш по стежці на північ від цього місця.'
Його слова викликають у тебе цікавість і рішучість, і ти розумієш, що це твій наступний крок на шляху до розкриття таємниць, що оточують тебе.
'''


road_to_bow_without_arrows = '''
Він вдивляється в твої речі й помічає, що в тебе немає дальньої зброї.

- 'Цікаво,' – каже він, злегка піднімаючи брову. – 'Де твій лук? Нелегка дорога чекає на того, хто не має всього необхідного спорядження.'
Ти знизуєш плечима, адже справді не маєш лука.

'Я знаю, де ти можеш його знайти,' – продовжує мандрівник. – 'Недалеко звідси, за старим мостом, за лісом є покинута церква. Кажуть, там зберігається древній лук, який колись належав великому воїну. Це місце приховане від очей більшості, але я впевнений, що ти знайдеш його, якщо підеш по стежці на північ від цього місця.'
Його слова викликають у тебе цікавість і рішучість, і ти розумієш, що це твій наступний крок на шляху до розкриття таємниць, що оточують тебе.
'''


merchant = '''
Ти йшов довгий час, пробираючись крізь густий, темний ліс. Вітер шелестів у гілках, створюючи відчуття, що за тобою хтось стежить. Важкі тіні дерев поглинали будь-яке світло, і лише зрідка місячні промені пробивалися крізь листя, висвітлюючи вузьку стежку під ногами. Час від часу ти чув шурхіт у кущах і дивні звуки, що долинали з глибини лісу, але ти продовжував рухатися вперед, тримаючи руку на руків'ї меча.

Раптом попереду ти помічаєш вогник – слабке світло, що ледь мерехтіло крізь дерева. Ти обережно підходиш ближче і бачиш невеликий табір. У його центрі сидить чоловік у потертій шкіряній куртці, поруч з ним стоїть старий візок, навантажений різним товаром. Він піднімає голову і дивиться на тебе з хитрою усмішкою.

- 'Що ж, що ж, кого це занесло у наші краї?' – з посмішкою каже він, уважно оглядаючи твоє спорядження. Його очі раптом зупиняються на одному з твоїх предметів. – 'Ого, це ж хілка! Давненько я таких не бачив. Скажу тобі чесно, це справжній раритет у цих лісах.'
Він підходить ближче і пропонує:

- 'Слухай, давай зробимо так – я дам тобі 20 монет за цю хілку. Гроші завжди потрібні в подорожі, а я давно шукаю щось подібне для своїх клієнтів. Угода вигідна для нас обох, як гадаєш?'
Ти розумієш, що монети можуть стати в пригоді у подальшій подорожі, і торгівець виглядає досить чесним, хоча й трохи хитрим. Тепер ти маєш зробити вибір – чи обміняти хілку на монети, чи залишити її собі, враховуючи можливі небезпеки попереду.
'''

not_confirm_trade = """
Ти вагаєшся, але зрештою вирішуєш залишити хілку собі. Ти чемно відмовляєшся від пропозиції торговця, і його усмішка трохи тьмяніє.

'Що ж, твоє право,' – знизуючи плечима, каже він. – 'Хто знає, можливо, ця хілка врятує тобі життя. Але пам’ятай – гроші теж можуть знадобитися.'
Ти продовжуєш свій шлях, залишивши торговця позаду. Зілля надійно сховане у твоєму рюкзаку, і ти відчуваєш полегшення від того, що зберіг його. Проте в глибині душі ти замислюєшся, чи не був би обмін вигідним у довгостроковій перспективі.
"""


confirm_trade = '''
Ти вагаєшся лише мить, але вирішуєш, що монети можуть знадобитися більше, ніж зілля, і простягаєш її торговцю. Він з радістю приймає зілля, а натомість дає тобі мішечок з монетами. Ти рахуєш їх – рівно 20.

'Гарна угода,' – задоволено каже торговець. – 'Ці монети відкриють тобі двері до багатьох можливостей. Хай твоя подорож буде успішною!'
Ти киваєш і продовжуєш свій шлях. Монети дзвенять у кишені, і ти відчуваєш, що твоя подорож стає трохи безпечнішою. У глибині душі, однак, ти відчуваєш легкий сумнів – чи не знадобиться тобі ця хілка пізніше?
'''


forest = """Ти йдеш через ліс, де зелена прохолода обіймає тебе з усіх боків. Великі дерева витягують свої гілки до самого неба, утворюючи густий шатер з листя, через яке ледь пробиваються промінчики сонця. Під ногами м’який килим з опалого листя і моху поглинає кожен твій крок, створюючи тихий шурхіт, що розноситься по навколишньому спокою.

Пахощі вологого ґрунту і соснових голок заповнюють повітря, що робить його свіже і наповнене енергією природи. Тихі шипіння комах і далекий спів птахів доповнюють гармонію цього природного середовища. Іноді ти чуєш, як вітер прошумує крізь гілки, створюючи звуки, схожі на шепіт древніх духів лісу.

Поступово стежка стає менш визначеною, а навколишня зелень – густішою і темнішою. Тіні від дерев стають довшими, а світло – слабшим, мовляв, ліс поглинає будь-яке сонячне проміння. Цей глибокий спокій, який ти відчуваєш, здається, приховує щось більше, і кожен твій крок відчувається, як маленьке випробування у цьому загадковому місці."""



monsters_plot = """Раптом ти відчуваєш, як навколишня тиша починає змінюватися. Шелест листя стає більш тривожним, а звуки лісу – різкішими і незвичними. Твоє серце починає битися швидше. Із-за кущів та дерев з'являються два монстри.

Перший монстр величезний і брудний. Його шкіра покрита темною, зловісною слизькою, а величезні кігті виглядають як гострі леза. Очі його світяться червоним, а з рота йдуть страшні реви, що розривають тишу. Це жахливий і страшний створіння, що створює справжню загрозу.

Другий монстр менший, але не менш жахливий. Це страшна істота з виглядом змії з ріжками і зубами, які висять з його рота. Його шкіра має темно-зелені відтінки і блищить в темряві. Він повзає швидко, а його рухи здаються злими і непередбачуваними.

Монстри оточують тебе з усіх боків, і ти відчуваєш, як серце б’ється швидше від тривоги. Ліс, що раніше був спокійним місцем, тепер став сценою жорстокої битви. Ти швидко дістаєш свій меч і готуєшся до бою. Кожен удар і кожна атака монстрів вимагають від тебе всіх сил і спритності.

Битва триває, і ти відчайдушно борешся, сподіваючись, що твої навички і рішучість допоможуть тобі подолати ці страхітливі істоти. Після кожної сутички ти відчуваєш полегшення, але ліс ще залишається наповненим темрявою і загадками, які чекають попереду."""




guild_choice = """
'Ти пройшов нелегкий шлях, і тепер час обрати гільдію. Кожна з них має свою силу,' — каже дідусь.

Він показує на сувій:
'Перша гільдія — Орден Місячного Зілля. Вони поєднують магію і зілляваріння. Їхні чарівники змінюють реальність, а алхіміки створюють зілля, що зцілюють або отруюють. Для тих, хто хоче стати майстром магічних мистецтв.'

Дідусь показує на меч:
'Друга гільдія — Легіон Вогняного Молота. Вони спеціалізуються на зброї та бойових мистецтвах. Їхні воїни відомі своєю майстерністю в бою та виготовленні надійної зброї. Для тих, хто шукає могутності в битві.'

Дідусь кидає погляд на компас:
'Третя гільдія — Шлях Мандрівного Вітру. Це братство розвідників і мисливців, які орієнтуються в будь-яких умовах і виживають у складних ситуаціях. Вони можуть бути союзниками чи ворогами.'

Дідусь посміхається:
'Кожна гільдія пропонує свій шлях. Вибір за тобою. Він визначить твою долю і те, ким ти станеш.'"""



question_ = """Уяви, що ти маєш об'єкт, і ти хочеш перевірити, чи є він екземпляром певного класу або його підкласу. Це дуже важливий навик для кожного, хто хоче стати майстром програмування. Тому я хочу, щоб ти подумав і відповів на наступне питання:"

Він подає тобі невеликий сувій, на якому написане питання:

"Як можна перевірити, що об'єкт є екземпляром певного класу або його підкласу?"

"Розглянь це питання, подумай і дай свою відповідь," — додає дідусь, продовжуючи спостерігати за тобою з цікавістю.

"Твоя правильна відповідь принесе тобі не лише знання, але й спеціальний приз, який я підготував для тебе."""



npc = """
- Ти йшов через табір, коли раптом почув знайомий голос за спиною. Оглянувшись, побачив одного з членів гільдії, знав більше, ніж казав. Він підійшов ближче, його обличчя було серйозним, а в очах читалося занепокоєння.

"Ти завжди йдеш своїм шляхом, але деякі речі не варто відкладати," — його голос був тихий, але впевнений. "Той лук, що ти шукаєш, лежить у старій церкві на краю лісу. Це не просто зброя, а ключ до твоєї сили, до твого майбутнього. Він може змінити хід твоєї подорожі."

Він зітхнув, ніби йому важко було це сказати.

"Я знаю, ти завжди обережний, але ця затримка може коштувати тобі дуже дорого. Час не на твоєму боці. Церква не чекатиме вічно, а лук — це те, що тобі потрібно, щоб рухатися далі."

Його слова були пронизливі, наче він знав про тебе більше, ніж ти сам. 

"Твоя міць — у твоїх руках, і цей лук може стати її частиною. Питання лише в тому, чи готовий ти забрати його зараз, чи ризикуєш втратити свій шанс назавжди?'"""



test_bow = """
Ти йшов по густому лісу, вдихаючи вологе повітря, насичене запахом землі та хвої. Темрява повільно обіймала тебе, перетворюючи дерева на примарні тіні, а лише поодинокі місячні промені пробивалися крізь густе листя, освітлюючи твій шлях. Лук, який ти недавно здобув, висів за плечима, і з кожним кроком ти відчував, як його сила поступово стає частиною тебе.

Раптом у темряві перед тобою промайнула тінь. Ти завмер, прислухаючись до нічних звуків. Знову швидкий рух — і цього разу ти помітив її чіткіше.Кажан пролетіла низько над твоєю головою, її крила безшумно розсікали повітря. Вона кружляла неподалік, ніби викликаючи тебе.

Ти зрозумів, що настав час протестувати лук.
"""


road_to_enchanter = """
"О, мої привітання друже!\nБачу все ж таки ти забрав лук, я не сумнівався. Наш чарівник хоче бачити тебе. Чув, що ти щойно здобув новий лук. Він каже, що може зачарувати його і надати йому особливих властивостей. Така можливість випадає нечасто."

Він зупинився, оцінюючи твою реакцію, а потім продовжив:

- "Його майстерня знаходиться неподалік, на північному краю бази, біля старого дуба. Поверни ліворуч від головних воріт, пройди через кам'яний дворик, а далі пряма стежка приведе тебе до нього. Він чекає на тебе, тож краще не гаяти часу."
"""



view_shop = """
Ти неквапливо прогулювався по базі, насолоджуючись знайомою атмосферою. Раптом твій погляд зупинився на невеликому магазині з вивіскою, де завжди було людно. Це був місцевий магазин їжі, місце, куди завжди можна було зайти, щоб перекусити.

Твої думки ненароком звернулися до того, що тут можна завжди знайти щось поживне, коли з’являється потреба. Вирішивши запам'ятати це місце, ти рушив далі, розуміючи, що можеш завжди повернутися сюди, коли захочеш підкріпитися по команді /shop.
"""