plots = {
    "plot1": "Ти прокидаєшся на галявині серед густого, туманного лісу. Сонячні промені ледь пробиваються крізь товсті крони дерев, а вологе повітря наповнене ароматом свіжої землі та рослинності. У голові відлунює гучний дзвін, і ти намагаєшся згадати, як потрапив сюди, але пам’ять розсипається, як пісок крізь пальці. Лише один спогад чітко тримається в твоїй свідомості – древній храм, схований у самому серці цього лісу, і відчуття, що саме там прихована відповідь на всі твої питання. Шлях до храму не буде легким: ліс відомий своїми небезпечними створіннями, таємничими пастками і зачарованими місцями, де реальність переплітається зі снами. Тобі доведеться покладатися на свою інтуїцію та хитрість, щоб дістатися до мети і дізнатися правду про своє минуле і майбутнє.",
    "plot2": "Рік 2147. Ти живеш у світі, де міста стали величезними механізмами, керованими штучним інтелектом. Людство поступово втратило свободу, підкоряючись ритму високотехнологічного суспільства. Ти – один з останніх незалежних хакерів, який ще не потрапив під контроль Системи. У своїй маленькій, захаращеній квартирі, серед мерехтіння моніторів та звуків кулера, ти отримуєш несподіване повідомлення: 'Система зламана. Єдиний шанс зупинити повний контроль – діяти зараз'. Відправником є невідомий тобі хакер, який називає себе «Тінню». Він дає тобі координати та інструкції для проникнення в головний сервер, де зберігається ядро Системи. Але дорога до нього буде сповнена небезпек: системні дрони, цифрові пастки і охоронні програми вже чекають на тебе. Ти маєш використати весь свій досвід, щоб обійти захист і розкрити змову, яка може визначити майбутнє всього людства.",
    "plot3": "У віддаленій частині світу, серед гір і лісів, заховані входи до древніх катакомб, які ніхто не наважується досліджувати. Легенди говорять про величезне підземне королівство, де жили істоти, забуті часом, і де зберігається артефакт неймовірної сили. Ти – дослідник, який вирішив знайти цей артефакт, що, за чутками, може змінити хід історії. Після місяців підготовки ти нарешті спускаєшся в темряву катакомб. Повітря стає важким, а тиша гнітить. Ступаючи вузькими коридорами, ти відчуваєш, що кожен твій крок чує хтось невидимий. На твоєму шляху зустрічаються древні фрески, що зображають сцени великих битв і невідомих істот. Ти розумієш, що це місце – не просто забута гробниця, а ціле підземне королівство, де ще живуть ті, хто його побудував. Твоя мета – знайти артефакт і вирішити, що з ним робити: знищити його, щоб уникнути катастрофи, або скористатися його силою, щоб змінити світ."

}


after_fight = '''
Ти важко дихаєш, відчуваючи, як кров пульсує у скронях. Монстр лежить переможений, але битва забрала у тебе чимало сил. Коли пил осідає, ти помічаєш, що за залишками тіні монстра ховається постать. Це старий мандрівник, одягнений у пошарпаний сірий плащ, який майже повністю приховує його худе тіло. Обличчя вкриває густа, сива борода, а під каптуром ледь видніються пронизливі, мудрі очі. Він виходить на світло і злегка кланяється.

- 'Вражаюча перемога,' – каже він хрипким голосом.
– 'Ця тварина давно охороняє шлях до забутої святині. Я знав, що рано чи пізно з’явиться той, хто зможе її перемогти.'
Його зморшкувате обличчя і напівусмішка вказують на досвід і життєву мудрість. Здається, цей мандрівник знає більше, ніж здається на перший погляд, і він може вказати тобі подальший шлях у твоїй пригоді.
'''


road_to_bow_with_arrows = '''
Він вдивляється в твої речі й помічає, що серед них є стріли.

- 'Цікаво,' – каже він, злегка піднімаючи брову. – 'Ти маєш стріли, але де твій лук? Нелегка дорога чекає на того, хто не має всього необхідного спорядження.'
Ти знизуєш плечима, адже справді не маєш лука.

'Я знаю, де ти можеш його знайти,' – продовжує мандрівник. – 'Недалеко звідси, за старим мостом, за лісом є покинута церква. Кажуть, там зберігається древній лук, який колись належав великому воїну. Це місце приховане від очей більшості, але я впевнений, що ти знайдеш його, якщо підеш по стежці на північ від цього місця.'
Його слова викликають у тебе цікавість і рішучість, і ти розумієш, що це твій наступний крок на шляху до розкриття таємниць, що оточують тебе.
'''


road_to_bow_without_arrows = '''
Він вдивляється в твої речі й помічає, що в тебе немає дальньої зброї.

- 'Цікаво,' – каже він, злегка піднімаючи брову. – 'Де твій лук? Нелегка дорога чекає на того, хто не має всього необхідного спорядження.'
Ти знизуєш плечима, адже справді не маєш лука.

'Я знаю, де ти можеш його знайти,' – продовжує мандрівник. – 'Недалеко звідси, за старим мостом, за лісом є покинута церква. Кажуть, там зберігається древній лук, який колись належав великому воїну. Це місце приховане від очей більшості, але я впевнений, що ти знайдеш його, якщо підеш по стежці на північ від цього місця.'
Його слова викликають у тебе цікавість і рішучість, і ти розумієш, що це твій наступний крок на шляху до розкриття таємниць, що оточують тебе.
'''


merchant = '''
Ти йшов довгий час, пробираючись крізь густий, темний ліс. Вітер шелестів у гілках, створюючи відчуття, що за тобою хтось стежить. Важкі тіні дерев поглинали будь-яке світло, і лише зрідка місячні промені пробивалися крізь листя, висвітлюючи вузьку стежку під ногами. Час від часу ти чув шурхіт у кущах і дивні звуки, що долинали з глибини лісу, але ти продовжував рухатися вперед, тримаючи руку на руків'ї меча.

Раптом попереду ти помічаєш вогник – слабке світло, що ледь мерехтіло крізь дерева. Ти обережно підходиш ближче і бачиш невеликий табір. У його центрі сидить чоловік у потертій шкіряній куртці, поруч з ним стоїть старий візок, навантажений різним товаром. Він піднімає голову і дивиться на тебе з хитрою усмішкою.

- 'Що ж, що ж, кого це занесло у наші краї?' – з посмішкою каже він, уважно оглядаючи твоє спорядження. Його очі раптом зупиняються на одному з твоїх предметів. – 'Ого, це ж хілка! Давненько я таких не бачив. Скажу тобі чесно, це справжній раритет у цих лісах.'
Він підходить ближче і пропонує:

- 'Слухай, давай зробимо так – я дам тобі 20 монет за цю хілку. Гроші завжди потрібні в подорожі, а я давно шукаю щось подібне для своїх клієнтів. Угода вигідна для нас обох, як гадаєш?'
Ти розумієш, що монети можуть стати в пригоді у подальшій подорожі, і торгівець виглядає досить чесним, хоча й трохи хитрим. Тепер ти маєш зробити вибір – чи обміняти хілку на монети, чи залишити її собі, враховуючи можливі небезпеки попереду.
'''

confirm_trade = """
Ти вагаєшся, але зрештою вирішуєш залишити хілку собі. Ти чемно відмовляєшся від пропозиції торговця, і його усмішка трохи тьмяніє.

'Що ж, твоє право,' – знизуючи плечима, каже він. – 'Хто знає, можливо, ця хілка врятує тобі життя. Але пам’ятай – гроші теж можуть знадобитися.'
Ти продовжуєш свій шлях, залишивши торговця позаду. Зілля надійно сховане у твоєму рюкзаку, і ти відчуваєш полегшення від того, що зберіг його. Проте в глибині душі ти замислюєшся, чи не був би обмін вигідним у довгостроковій перспективі.
"""


not_confirm_trade = '''
Ти вагаєшся лише мить, але вирішуєш, що монети можуть знадобитися більше, ніж зілля, і простягаєш її торговцю. Він з радістю приймає зілля, а натомість дає тобі мішечок з монетами. Ти рахуєш їх – рівно 20.

'Гарна угода,' – задоволено каже торговець. – 'Ці монети відкриють тобі двері до багатьох можливостей. Хай твоя подорож буде успішною!'
Ти киваєш і продовжуєш свій шлях. Монети дзвенять у кишені, і ти відчуваєш, що твоя подорож стає трохи безпечнішою. У глибині душі, однак, ти відчуваєш легкий сумнів – чи не знадобиться тобі ця хілка пізніше?
'''